{
  "class_name": "Functional",
  "config": {
    "name": "model",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null, 130],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_1"
        },
        "name": "input_1",
        "inbound_nodes": []
      },
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null, 130],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_2"
        },
        "name": "input_2",
        "inbound_nodes": []
      },
      {
        "class_name": "Embedding",
        "config": {
          "name": "embedding",
          "trainable": false,
          "batch_input_shape": [null, 130],
          "dtype": "float32",
          "input_dim": 91015,
          "output_dim": 300,
          "embeddings_initializer": {
            "class_name": "RandomUniform",
            "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
          },
          "embeddings_regularizer": null,
          "activity_regularizer": null,
          "embeddings_constraint": null,
          "mask_zero": false,
          "input_length": 130
        },
        "name": "embedding",
        "inbound_nodes": [[["input_1", 0, 0, {}]], [["input_2", 0, 0, {}]]]
      },
      {
        "class_name": "LSTM",
        "config": {
          "name": "lstm",
          "trainable": true,
          "dtype": "float32",
          "return_sequences": false,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "time_major": false,
          "units": 50,
          "activation": "tanh",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "shared_object_id": 4
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": { "gain": 1.0, "seed": null },
            "shared_object_id": 5
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {},
            "shared_object_id": 6
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 2
        },
        "name": "lstm",
        "inbound_nodes": [[["embedding", 0, 0, {}]], [["embedding", 1, 0, {}]]]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout",
        "inbound_nodes": [[["lstm", 0, 0, {}]], [["lstm", 1, 0, {}]]]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": "float32",
          "units": 100,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense",
        "inbound_nodes": [[["dropout", 0, 0, {}]], [["dropout", 1, 0, {}]]]
      },
      {
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate",
          "trainable": true,
          "dtype": "float32",
          "axis": -1
        },
        "name": "concatenate",
        "inbound_nodes": [
          [
            ["dense", 0, 0, {}],
            ["dense", 1, 0, {}]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": "float32",
          "units": 1,
          "activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_1",
        "inbound_nodes": [[["concatenate", 0, 0, {}]]]
      }
    ],
    "input_layers": [
      ["input_1", 0, 0],
      ["input_2", 0, 0]
    ],
    "output_layers": [["dense_1", 0, 0]]
  },
  "keras_version": "2.9.0",
  "backend": "tensorflow"
}
